{"name":"George","headerTaglineOne":"Hello","headerTaglineTwo":"My name is George Fakhre, I'm a frontend developer focused on ","headerTaglineThree":"building fast, accessible, and user-friendly web experiences.","headerTaglineFour":"Based in Byblos, Lebanon.","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/george-fakhre-2136b2202/"},{"id":"5","title":"Email","link":"mailto:gfakhre@fmail.com"}],"projects":[{"id":"1","title":"Uplo","description":"Frontend Developer","imageSrc":"images/Uplo.webp","url":"https://www.uplo.io/"},{"id":"2","title":"Calvin Klein","description":"Frontend Developer","imageSrc":"images/Calvin-Klein.webp","url":"https://www.calvinklein.ae/"},{"id":"3","title":"Tefal","description":"Frontend Developer","imageSrc":"images/Tefal.webp","url":"https://www.tefal.sa/en/"},{"id":"4","title":"Moulinex","description":"Frontend Developer","imageSrc":"images/Moulinex.webp","url":"https://www.tefal.sa/en/moulinex.html"},{"id":"5","title":"Krups","description":"Frontend Developer","imageSrc":"images/Krups.webp","url":"https://www.tefal.sa/en/krups.html"}],"services":[{"id":"1","title":"Frontend Development","description":"I craft responsive, accessible, and performant web interfaces using modern frameworks and best practices."},{"id":"2","title":"Website Optimization","description":"I improve loading speed, SEO, and overall user experience to boost engagement and conversions."},{"id":"3","title":"UI Implementation","description":"I take Figma or design mockups and turn them into clean, maintainable, and pixel-perfect code."},{"id":"4","title":"Email Templates & Newsletters","description":"Developing responsive, cross-client email templates that look great everywhere."},{"id":"e37414f1-fbdf-4a1b-bfb7-61954c9d6ec4","title":"Maintenance & Feature Enhancements","description":"Keeping your site up-to-date, bug-free, and evolving with your needs."}],"aboutpara":"I’m a frontend developer based in Lebanon with a passion for building clean, fast, and accessible web experiences.","aboutpara2":"I have experience working with Magento 2 and Shopify, creating B2C websites and B2B portals. I’ve also worked in the fintech sector, developing secure and scalable B2B portals, as well as building informative corporate websites that strengthen online presence.","aboutpara3":"Throughout my career, I’ve worked both as the sole frontend developer in a company and as part of a collaborative team, giving me a strong ability to adapt to different workflows and environments. My focus is always on delivering performant, user-friendly, and maintainable solutions.","resume":{"tagline":"I’m a Frontend Developer specializing in building fast, scalable, and user-friendly web experiences.","description":"I have built and optimized B2C websites, B2B portals, and corporate platforms using React, JavaScript, Magento 2, Shopify, and other modern web technologies—delivering seamless user experiences across industries.","experiences":[{"id":"1","dates":"May 2023 – Present","type":"Full Time","position":"FRONTEND DEVELOPER, UPLO","bullets":"Built and maintained eCommerce websites using Magento 2 including high-profile brands such as calvinklein.ae tefal.sa Moulinex.s and Krups.sa, Implemented regular content updates performance optimizations and seasonal refreshes to ensure seamless user experiences, Developed the company website (uplo.io) and a customer portal using React providing clients with access to real-time data and insights, Collaborated closely with designers product owners and occasionally clients to align on requirements and deliver features based on ticketing systems l Designed and sent the company’s monthly newsletter ensuring consistent branding and effective communication with clients, Ensured responsive design accessibility and best practices across all frontend codebases"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2019 – April 2023","type":"Full Time","position":"JUNIOR FULLSTACK DEVELOPER, FLEXXPAY","bullets":"Focused primarily on frontend development using Angular while contributing to backend features with .NET and C#,  Led development of the company website and served as the main frontend developer for employee employer and admin portals in a fintech environment, Designed and implemented responsive landing pages marketing campaigns and promotional content, Created and managed dynamic email templates and newsletters including database integration and user targeting, Collaborated with cross-functional teams to deliver secure scalable solutions for payroll and salary advance services"},{"id":"05c2665c-13e1-45d4-8073-891822c1b3ac","dates":"June 2012 – September 2019","type":"Full Time","position":"RECEPTIONIST & NIGHT AUDITOR, Byblos Sur Mer Hotel and Resort","bullets":"Led a team of front desk staff managing schedules delegating responsibilities and ensuring smooth daily operations, Handled guest check-ins and check-outs reservations and special requests with a focus on excellent customer service, Performed nightly audits reconciled accounts and closed cash registers for all hotel restaurants and outlets, Ensured high standards of guest satisfaction and resolved issues promptly and professionally"}],"education":{"universityName":"UNDERGRADUATE STUDIES, ARTS, SCIENCES AND TECHNOLOGY UNIVERSITY IN LEBANON (AUL)","universityDate":"2016-2020","universityPara":"Bachelor’s in Computer Science – In Progress (Few credits remaining)"},"languages":["JavaScript (ES6+)","HTML5","CSS3/SCSS","C#"],"frameworks":["React","Angular"],"others":["Magento 2 ","Shopify","Responsive & Accessible design (WCAG)"," SEO best practices"],"resumeName":"George Fakhre"},"aboutpar3":"Throughout my career, I’ve worked both as the sole frontend developer in a company and as part of a collaborative team, giving me a strong ability to adapt to different workflows and environments. My focus is always on delivering performant, user-friendly, and maintainable solutions.a"}